//1. Задать температуру в градусах по Цельсию. Вывести в alert соответствующую температуру 
//в градусах по Фаренгейту. Подсказка: расчёт идёт по формуле: Tf = (9 / 5) * Tc + 32, 
//где Tf – температура по Фаренгейту, Tc – температура по Цельсию



//2. Работа с переменными.

//Решение с использованием "+" и "-"
var a=1, b=2;
a=a+b;
b=a-b;
a=a-b;

//Более компактный вариант
var a=1, b=2;
[a,b]=[b,a];

//3. Объявить две переменные: admin и name. Записать в name строку "Василий"; 
//Скопировать значение из name в admin. Вывести admin (должно вывести «Василий»).



//4. *Чему будет равно JS-выражение 1000 + "108"/

1108?

//5. *Самостоятельно разобраться с атрибутами тега script (async и defer)/